Revit 2024 API
Family.IsOwnerFamily Property
 True if the family is the owner family for its own editable document, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsOwnerFamily { get; }
Visual Basic
Public ReadOnly Property IsOwnerFamily As Boolean
	Get
Visual C++
public:
property bool IsOwnerFamily {
	bool get ();
}
See Also
Family Class
Autodesk.Revit.DB Namespace